fortebit/opentracker-stm32-core/boards.txt
Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_64.menu.opt.osstd.build.flags.ldspecs=
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1std.build.flags.ldspecs=
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2std.build.flags.ldspecs=
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3std.build.flags.ldspecs=
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.ogstd=Debug (-g)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_64.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_32.menu.opt.osstd.build.flags.ldspecs=
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1std.build.flags.ldspecs=
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2std.build.flags.ldspecs=
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3std.build.flags.ldspecs=
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.ogstd=Debug (-g)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_32.menu.opt.ogstd.build.flags.ldspecs=

Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.osstd.build.flags.optimize=-Os
Disco.menu.opt.osstd.build.flags.ldspecs=
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.oslto.build.flags.ldspecs=-flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1std.build.flags.ldspecs=
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o1lto.build.flags.ldspecs=-flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2std.build.flags.ldspecs=
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o2lto.build.flags.ldspecs=-flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3std.build.flags.ldspecs=
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.o3lto.build.flags.ldspecs=-flto
Disco.menu.opt.ogstd=Debug (-g)
Disco.menu.opt.ogstd.build.flags.optimize=-g -Og
Disco.menu.opt.ogstd.build.flags.ldspecs=


################################################################################
# Custom boards

Custom.name=Custom Boards

Custom.build.vid=0x0483
Custom.build.pid=0x5711
Custom.vid.0=0x0483
Custom.pid.0=0x5711

Custom.build.core=arduino
Custom.build.board=Custom
Custom.build.extra_flags=-D{build.product_line} {build.enable_usb} -DALL_HWSERIAL

# OPENTRACKER_V3 board
# Support: ?????
Custom.menu.pnum.OPENTRACKER_V3=OpenTracker v3
Custom.menu.pnum.OPENTRACKER_V3.node=""
Custom.menu.pnum.OPENTRACKER_V3.upload.maximum_size=262144
Custom.menu.pnum.OPENTRACKER_V3.upload.maximum_data_size=65536
Custom.menu.pnum.OPENTRACKER_V3.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Custom.menu.pnum.OPENTRACKER_V3.build.f_cpu=80000000L
Custom.menu.pnum.OPENTRACKER_V3.build.board=OPENTRACKER_V3
Custom.menu.pnum.OPENTRACKER_V3.build.series=STM32L4xx
Custom.menu.pnum.OPENTRACKER_V3.build.product_line=STM32L433xx
Custom.menu.pnum.OPENTRACKER_V3.build.variant=OPENTRACKER_V3
Custom.menu.pnum.OPENTRACKER_V3.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Custom.menu.upload_method.MassStorage=Mass Storage
Custom.menu.upload_method.MassStorage.upload.protocol=
Custom.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Custom.menu.upload_method.STLink=STLink
Custom.menu.upload_method.STLink.upload.protocol=STLink
Custom.menu.upload_method.STLink.upload.tool=stlink_upload

# USB
Custom.menu.usb.none=None
Custom.menu.usb.HID=HID keyboard and mouse support (if available)
Custom.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
Custom.menu.usb.CDC=CDC (if available)
Custom.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

# Optimizations
Custom.menu.opt.osstd=Smallest (-Os default)
Custom.menu.opt.osstd.build.flags.optimize=-Os
Custom.menu.opt.osstd.build.flags.ldspecs=
Custom.menu.opt.oslto=Smallest (-Os) with LTO
Custom.menu.opt.oslto.build.flags.optimize=-Os -flto
Custom.menu.opt.oslto.build.flags.ldspecs=-flto
Custom.menu.opt.o1std=Fast (-O1)
Custom.menu.opt.o1std.build.flags.optimize=-O1
Custom.menu.opt.o1std.build.flags.ldspecs=
Custom.menu.opt.o1lto=Fast (-O1) with LTO
Custom.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Custom.menu.opt.o1lto.build.flags.ldspecs=-flto
Custom.menu.opt.o2std=Faster (-O2)
Custom.menu.opt.o2std.build.flags.optimize=-O2
Custom.menu.opt.o2std.build.flags.ldspecs=
Custom.menu.opt.o2lto=Faster (-O2) with LTO
Custom.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Custom.menu.opt.o2lto.build.flags.ldspecs=-flto
Custom.menu.opt.o3std=Fastest (-O3)
Custom.menu.opt.o3std.build.flags.optimize=-O3
Custom.menu.opt.o3std.build.flags.ldspecs=
Custom.menu.opt.o3lto=Fastest (-O3) with LTO
Custom.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Custom.menu.opt.o3lto.build.flags.ldspecs=-flto
Custom.menu.opt.ogstd=Debug (-g)
Custom.menu.opt.ogstd.build.flags.optimize=-g -Og
Custom.menu.opt.ogstd.build.flags.ldspecs=
